---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.Is3DMImportLinkAvailable
source: html/bc7007c6-53cf-0150-340d-64f3b5ed19c8.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.Is3DMImportLinkAvailable Method

Checks whether the 3DM Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool Is3DMImportLinkAvailable()
```

## Returns
True if the 3DM Import/Link functionality is available in the installed Revit.

## Remarks
3DM Import/Link is optional functionality that does not have to be part of the Revit installation.